def get_count_char(str_):
    zxc_ = {}     # TODO посчитать количество каждой буквы в строке в аргументе str_
    str_ = "".join(str_.split())
    str_ = str_.lower()
    for char, in str_:
        if char.isalpha():
            if char in zxc_:
                zxc_[char] += 1
            else:
                zxc_[char] = 1
    return zxc_
main_str = """
    Данное предложение будет разбиваться на отдельные слова. 
    В качестве разделителя для встроенного метода split будет выбран символ пробела. На выходе мы получим список отдельных слов. 
    Далее нужно отсортировать слова в алфавитном порядке, а после сортировки склеить их с помощью метода строк join. Приступим!!!!
"""
print(get_count_char(main_str))
